app/controllers/exchange_controller.rb

SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` ASC
SELECT  `tokens`.* FROM `tokens` WHERE (symbol = 'TM') ORDER BY `tokens`.`id` ASC LIMIT 1
---
  def wallet
    base_token = params[:trade_pair].split("-")[1]
    token_symbol = params[:trade_pair].split("-")[0]
    @refer_id = $refer_id
    @base_token = base_token

    # ETH token table
    @tokenlist = get_token_list

    @tokens_list = get_tokens_list_wallet

    @notifications = Notification.order(created_at: :asc)

    token = Token.where("symbol = ?",token_symbol).first

SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` ASC
SELECT  `tokens`.* FROM `tokens` WHERE (symbol = 'TM') ORDER BY `tokens`.`id` ASC LIMIT 1
---
  def overview
    base_token = params[:trade_pair].split("-")[1]
    token_symbol = params[:trade_pair].split("-")[0]
    @refer_id = $refer_id
    @base_token = base_token

    # # ETH token table
    @tokenlist = get_token_list

    @notifications = Notification.order(created_at: :asc)

    token = Token.where("symbol = ?",token_symbol).first

SELECT  `tokens`.* FROM `tokens` WHERE (symbol = 'TM') ORDER BY `tokens`.`id` ASC LIMIT 1
SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` ASC
SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT type,price,sum(amount) as amount, min(expire) as expire FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY `orders`.`price` DESC
SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 0 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT MIN(`orders`.`price`) FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 0
SELECT type,price,sum(amount) as amount, min(expire) as expire FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY `orders`.`price` DESC
SELECT MAX(`orders`.`price`) FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 1
---
  def trade
    base_token = params[:trade_pair].split("-")[1]
    token_symbol = params[:trade_pair].split("-")[0]
    @refer_id = $refer_id
    @base_token = base_token
    @eth_price = get_eth_price
    # Get messages
    @messages = Message.order(updated_at: :asc)
    # ETH token table
    @tokenlist = get_token_list

    @tokens_list = get_tokens_list_wallet
    # TM token table
    @tmtokenlist = Token.where("tm_field = ?", 1).order(symbol: :asc)

    @notifications = Notification.order(created_at: :asc)

    token = Token.where("symbol = ?",token_symbol).first
    if token
      @zrxtoken = token
      buy_orders = Order.select("type,price,sum(amount) as amount, min(expire) as expire").where(base_token:base_token,token_symbol:token_symbol,type:1).group("price").order(price: :desc)
      sell_orders = Order.select("type,price,sum(amount) as amount, min(expire) as expire").where(base_token:base_token,token_symbol:token_symbol,type:0 ).group("price").order(price: :asc)
      # max_amount = Order.select("sum(amount) as amount").where(base_token:base_token,token_symbol:token_symbol).maximum("amount")
      buy_max = Order.select("sum(amount) as mamount").where(base_token:base_token,token_symbol:token_symbol,type:1).group("price").order("mamount DESC").first
      sell_max = Order.select("sum(amount) as mamount").where(base_token:base_token,token_symbol:token_symbol,type:0).group("price").order("mamount DESC").first
      best_asks = Order.where(base_token:base_token,token_symbol:token_symbol,type:0).minimum("price");
      best_bids = Order.where(base_token:base_token,token_symbol:token_symbol,type:1).maximum("price");

SELECT  `trade_histories`.* FROM `trade_histories` WHERE `trade_histories`.`base_token` = 'WETH' AND `trade_histories`.`token_symbol` = 'TM' ORDER BY `trade_histories`.`updated_at` DESC LIMIT 100
---
        @sell_orders.push json_record
      end

      trade_histories = TradeHistory.where(base_token:base_token,token_symbol:token_symbol).limit(100).order(updated_at: :desc)

SELECT  `tokens`.* FROM `tokens` WHERE (symbol = 'ZRX') ORDER BY `tokens`.`id` ASC LIMIT 1
SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 0 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT MIN(`orders`.`price`) FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 0
SELECT type,price,sum(amount) as amount, min(expire) as expire FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY `orders`.`price` DESC
SELECT MAX(`orders`.`price`) FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 1
---
        @trade_histories.push json_record
      end
    else
      @zrxtoken = Token.where("symbol = ?","ZRX").first
      buy_orders = Order.select("type,price,sum(amount) as amount, min(expire) as expire").where(base_token:base_token,token_symbol:"ZRX",type:1).group("price").order(price: :desc)
      sell_orders = Order.select("type,price,sum(amount) as amount, min(expire) as expire").where(base_token:base_token,token_symbol:"ZRX",type:0 ).group("price").order(price: :asc)
      # max_amount = Order.select("sum(amount) as amount").where(base_token:base_token,token_symbol:token_symbol).maximum("amount")
      buy_max = Order.select("sum(amount) as mamount").where(base_token:base_token,token_symbol:"ZRX",type:1).group("price").order("mamount DESC").first
      sell_max = Order.select("sum(amount) as mamount").where(base_token:base_token,token_symbol:"ZRX",type:0).group("price").order("mamount DESC").first
      best_asks = Order.where(base_token:base_token,token_symbol:"ZRX",type:0).minimum("price");
      best_bids = Order.where(base_token:base_token,token_symbol:"ZRX",type:1).maximum("price");

SELECT `users`.* FROM `users` WHERE (recommended_id = '4b7857d93') ORDER BY `users`.`created_at` ASC
---
  def get_users
    referral_id  = params[:referral_id]
    refer_users = User.where("recommended_id = ?", referral_id).order(created_at: :asc)
    if refer_users.length > 0

SELECT `tokens`.* FROM `tokens` WHERE (symbol != 'WETH') ORDER BY `tokens`.`created_at` ASC
---
  def get_init_data
    base_token = params[:base_token]
    symbol = params[:token_symbol]
    token_addr = params[:token_address]
    tokens = Token.where("symbol != ?","WETH").order(created_at: :asc)
    tm_tokens = Token.where("tm_field = ?", 1).order(created_at: :asc)
    usdc_tokens = Token.where("usdc_field = ?", 1).order(created_at: :asc)
    wbtc_tokens = Token.where("wbtc_field = ?", 1).order(created_at: :asc)

SELECT  `tokens`.* FROM `tokens` WHERE `tokens`.`symbol` = 'TM' ORDER BY `tokens`.`id` ASC LIMIT 1
---
    wbtc_tokens_array = wbtc_tokens_array.sort_by!{ |k| k[:h_volume]}.reverse!

    # Select token info
    token = Token.where(:symbol => symbol).first

SELECT  `tokens`.* FROM `tokens` WHERE `tokens`.`symbol` = 'TM' ORDER BY `tokens`.`id` ASC LIMIT 1
---
  def find_token
    token_symbol = params[:token_symbol]
    base_token = params[:base_token]
    token = Token.where(:symbol => token_symbol).first

SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1 ORDER BY `messages`.`created_at` ASC
---
  def get_messages
    room_id = params[:param1]
    messages = Message.where(room_id: room_id ).order(created_at: :asc)

SELECT `orders`.* FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`maker_address` = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6' ORDER BY `orders`.`created_at` ASC
---
  def get_my_open_orders
    wallet_address = params[:wallet_addr]
    base_token = params[:base_token]
    token_symbol = params[:token_symbol]
    my_orders = Order.where(base_token:base_token,maker_address:wallet_address).order(created_at: :asc)
    if my_orders.length > 0

SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT  price,type FROM `orders` WHERE (base_token = 'WETH' AND token_symbol = 'TM') ORDER BY `orders`.`id` DESC LIMIT 1
SELECT `orders`.* FROM `orders` WHERE (base_token = 'WETH' AND token_symbol = 'TM' AND price <= 0.0001 AND type = 0) ORDER BY `orders`.`price` DESC
SELECT `tokens`.* FROM `tokens` WHERE (wbtc_field = 1) ORDER BY `tokens`.`created_at` ASC
SELECT  `trade_histories`.* FROM `trade_histories` WHERE (created_at < '2019-04-04 04:00:00' AND token_symbol = 'TM' AND base_token = 'WETH') ORDER BY `trade_histories`.`created_at` DESC LIMIT 1
---
  def get_orders
    token_symbol = params[:symbol]
    base_token = params[:base_token]
    last_order = Order.select("price,type").where("base_token = ? AND token_symbol = ?",base_token,token_symbol).last
    if last_order
      if last_order.type == 1
        match_order = Order.where("base_token = ? AND token_symbol = ? AND price <= ? AND type = ?",base_token,token_symbol,last_order.price,0).order(price: :desc)
      elsif last_order.type == 0
        match_order = Order.where("base_token = ? AND token_symbol = ? AND price >= ? AND type = ?",base_token,token_symbol,last_order.price,1).order(price: :desc)
      end
    else
      matched = 0
    end
    if match_order
      if match_order.length > 0
        matched = 1
      else
        matched = 0
      end
    else
      matched = 0
    end
    last_day_trade = TradeHistory.where("created_at < ? AND token_symbol = ? AND base_token = ?",Time.now.midnight,token_symbol,base_token).order(created_at: :asc).last

SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 0 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT MIN(`orders`.`price`) FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 0
SELECT MAX(`orders`.`price`) FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TM' AND `orders`.`type` = 1
---
    buy_orders = Order.select("type,price,sum(amount) as amount, min(expire) as expire").where(base_token:base_token,token_symbol:token_symbol,type:1).group("price").order(price: :desc)
    sell_orders = Order.select("type,price,sum(amount) as amount, min(expire) as expire").where(base_token:base_token,token_symbol:token_symbol,type:0 ).group("price").order(price: :asc)
    # max_amount = Order.select("sum(amount) as amount").where(base_token:base_token,token_symbol:token_symbol).maximum("amount")
    buy_max = Order.select("sum(amount) as mamount").where(base_token:base_token,token_symbol:token_symbol,type:1).group("price").order("mamount DESC").first
    sell_max = Order.select("sum(amount) as mamount").where(base_token:base_token,token_symbol:token_symbol,type:0).group("price").order("mamount DESC").first
    best_asks = Order.where(base_token:base_token,token_symbol:token_symbol,type:0).minimum("price");
    best_bids = Order.where(base_token:base_token,token_symbol:token_symbol,type:1).maximum("price");

SELECT `orders`.* FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`maker_address` = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6' ORDER BY `orders`.`updated_at` DESC
SELECT `tokens`.* FROM `tokens` WHERE (usdc_field = 1) ORDER BY `tokens`.`created_at` ASC
SELECT `trade_histories`.* FROM `trade_histories` WHERE (base_token = 'WETH' AND maker_address = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6' OR taker_address = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6') ORDER BY `trade_histories`.`updated_at` DESC
---
  def get_owner_data
    account_address = params[:account_address]
    base_token = params[:base_token]
    my_orders = Order.where(base_token:base_token,maker_address:account_address).order(updated_at: :desc)
    order_exist = false
    trade_exist = false
    if my_orders.length > 0
      order_exist = true
    end
    my_trades = TradeHistory.where("base_token = ? AND maker_address = ? OR taker_address = ?",base_token,account_address,account_address).order(updated_at: :desc)

SELECT `pending_trades`.* FROM `pending_trades` WHERE (maker_address = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6' OR taker_address = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6') ORDER BY `pending_trades`.`created_at` DESC
---
  def get_tx
    userAddress = params[:address]
    pending_trades = PendingTrade.where("maker_address = ? OR taker_address = ?", userAddress, userAddress).order(created_at: :desc);

SELECT  `pending_trades`.* FROM `pending_trades` WHERE `pending_trades`.`txHash` = '0x491158e1e64b50f63a3af5189a252ceec989612d9f03516c6a30e1896d9cd052' ORDER BY `pending_trades`.`id` ASC LIMIT 1
DELETE FROM `pending_trades` WHERE `pending_trades`.`id` = 1
SELECT  `pending_trades`.* FROM `pending_trades` WHERE `pending_trades`.`id` = 1 LIMIT 1
---
  def remove_tx
    txHash = params[:txHash]
    json_data = {
      "status":"ok"
    }

    pending_trade = PendingTrade.where(txHash:txHash).first
    if pending_trade
      PendingTrade.find(pending_trade.id).destroy

SELECT  `trade_histories`.* FROM `trade_histories` WHERE `trade_histories`.`base_token` = 'WETH' AND `trade_histories`.`token_symbol` = 'TM' ORDER BY `trade_histories`.`updated_at` DESC LIMIT 100
---
  def get_trade_history
    symbol = params[:symbol]
    base_token = params[:base_token]
    trade_histories = TradeHistory.where(base_token:base_token,token_symbol:symbol).limit(100).order(updated_at: :desc)

SELECT `reward_managers`.* FROM `reward_managers` WHERE (wallet_address = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6') ORDER BY `reward_managers`.`created_at` DESC
SELECT `trade_histories`.* FROM `trade_histories` WHERE (created_at > '2019-01-30 07:38:35' AND base_token = 'WETH' AND reward_status IS NULL AND (maker_address = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6' OR taker_address = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6')) ORDER BY `trade_histories`.`created_at` DESC
---
  def get_reward
    user_wallet_address = params[:wallet_address]
    init_volume = 0;
    claimed = RewardManager.where("wallet_address = ?",user_wallet_address).order(created_at: :desc)
    if claimed.length > 0
      trades = TradeHistory.where("created_at > ? AND base_token = ? AND reward_status IS NULL AND (maker_address = ? OR taker_address = ?)",claimed[0].created_at,"WETH",user_wallet_address,user_wallet_address).order(created_at: :desc)
      # trades = TradeHistory.where("created_at > ? AND base_token = ? AND reward_status IS NULL AND taker_address = ?",claimed[0].created_at,"WETH",user_wallet_address).order(created_at: :desc)
    else
      init_volume = 1000;
      trades = TradeHistory.where("base_token = ? AND reward_status IS NULL AND (maker_address = ? OR taker_address = ?)","WETH",user_wallet_address,user_wallet_address).order(created_at: :desc)

SELECT `referral_managers`.* FROM `referral_managers` WHERE (wallet_address = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6') ORDER BY `referral_managers`.`created_at` DESC
---
  def get_referral
    user_wallet_address = params[:wallet_address]
    claimed = ReferralManager.where("wallet_address = ?",user_wallet_address).order(created_at: :desc)