app/controllers/user_sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`wallet_address` = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6' LIMIT 1
INSERT INTO `users` (`wallet_address`, `nick_name`, `created_at`, `updated_at`, `referral_id`) VALUES ('0x2c54b6d93f3fc0bcf802eae179fa85f2c21527e3', 'sdf', '2019-04-04 08:27:59', '2019-04-04 08:27:59', '727891a92')
SELECT  `users`.* FROM `users` WHERE `users`.`wallet_address` = '0x2c54b6d93f3fc0bcf802eae179fa85f2c21527e3' LIMIT 1
---
  def user_login
    if params[:login_type] == 'META_MASK'
      wallet_address = params[:wallet_address]
      nick_name = params[:nick_name]
      refer_id = params[:refer_id]
      @user = User.find_by wallet_address: wallet_address
      if @user
        @user.nick_name = nick_name
      else

        referral_id = mk_referral_id(wallet_address)
        @user = User.new(params.permit(:wallet_address, :nick_name))
        if refer_id != nil && refer_id != ""
          @user.recommended_id = refer_id
        end
        @user.referral_id = referral_id
      end
      @user.save
      set_current_user(@user)
    elsif params[:login_type] == 'LEDGER'

    elsif params[:login_type] == 'TOKENMOM'
      wallet_address = params[:wallet_address]
      nick_name = params[:nick_name]
      refer_id = params[:refer_id]
      @user = User.find_by wallet_address: wallet_address

UPDATE `users` SET `nick_name` = 'fff', `updated_at` = '2019-04-04 08:46:32' WHERE `users`.`id` = 46
INSERT INTO `users` (`wallet_address`, `nick_name`, `created_at`, `updated_at`, `referral_id`) VALUES ('0x2c54b6d93f3fc0bcf802eae179fa85f2c21527e3', 'sdf', '2019-04-04 08:27:59', '2019-04-04 08:27:59', '727891a92')
---
        end
        @user.referral_id = referral_id
      end
      @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`wallet_address` = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6' LIMIT 1
---
      wallet_address = params[:wallet_address]
      nick_name = params[:nick_name]
      refer_id = params[:refer_id]
      @user = User.find_by wallet_address: wallet_address

INSERT INTO `users` (`wallet_address`, `nick_name`, `created_at`, `updated_at`, `referral_id`) VALUES ('0x58681da6a30c509f330dc8864e0af4e59600c521', '123', '2019-05-08 16:47:40', '2019-05-08 16:47:40', '316931f4d')
UPDATE `users` SET `nick_name` = 'zxc', `updated_at` = '2019-04-04 09:01:56' WHERE `users`.`id` = 46
---
        end
        @user.referral_id = referral_id
      end
      @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`wallet_address` = '0x0fe1829403d422470cd4cf0abad4bcec9aa2ebf6' LIMIT 1
---
  def get_user
    @user = User.find_by wallet_address: params[:wallet_address]