app/models/token.rb

SELECT  `trade_histories`.* FROM `trade_histories` WHERE `trade_histories`.`token_symbol` = 'TM' AND `trade_histories`.`base_token` = 'WETH' ORDER BY `trade_histories`.`id` DESC LIMIT 1
---
  def last_price(based_token='WETH')
    last = TradeHistory.where(token_symbol:self.symbol,base_token:based_token).last

SELECT  `trade_histories`.* FROM `trade_histories` WHERE (created_at > '2019-04-04 04:00:00' AND token_symbol = 'TM' AND base_token = 'WETH') ORDER BY `trade_histories`.`id` DESC LIMIT 1
SELECT  `trade_histories`.* FROM `trade_histories` WHERE (created_at < '2019-05-20 04:00:00' AND token_symbol = 'TM' AND base_token = 'WETH') ORDER BY `trade_histories`.`created_at` DESC LIMIT 1
---
  def h_price(based_token='WETH')
    h_price = TradeHistory.where("created_at > ? AND token_symbol = ? AND base_token = ?",Time.now.midnight,self.symbol,based_token).last
    if h_price
      pre_price = TradeHistory.where("created_at < ? AND token_symbol = ? AND base_token = ?",Time.now.midnight,self.symbol,based_token).order(created_at: :asc).last

SELECT `trade_histories`.* FROM `trade_histories` WHERE (created_at > '2019-04-04 04:00:00' AND token_symbol = 'TM' AND base_token = 'WETH')
---
  def h_volume(based_token='WETH')
    volumes = TradeHistory.where("created_at > ? AND token_symbol = ? AND base_token = ?",Time.now.midnight,self.symbol,based_token)
    h_volume = 0
    if volumes.length > 0